{
  "name": "non-combat random encounter",
  "items": [
    {
      "title": "Experienced Adventurers",
      "description": "The players encounter a group of more experienced adventurers heading in the other direction. If the players are polite, they are given some healing potions."
    },
    {
      "title": "Naked Gnome",
      "description": "A naked gnome runs across the path, gasps at the party, then runs back. Cannot be pursued."
    },
    {
      "title": "Omen: Thunder",
      "description": "A roll of thunder."
    },
    {
      "title": "Omen: Black Dog",
      "description": "A black dog runs across the path."
    },
    {
      "title": "Omen: Yellow Flower",
      "description": "A lone yellow flower is growing in the middle of the path."
    },
    {
      "title": "Omen: Shadow",
      "description": "A shadow drifts over the party."
    },
    {
      "title": "Omen: Pool of Blood",
      "description": "A pool of blood."
    },
    {
      "title": "Omen: Earth Shakes",
      "description": "The earth shakes briefly."
    },
    {
      "title": "Omen: Sunburst",
      "description": "The sun bursts through an overclouded sky."
    },
    {
      "title": "Omen: White Horse",
      "description": "A beautiful white horse dashes past the party and disappears."
    },
    {
      "title": "Friendly Humans' Encampment",
      "description": "The players find an encampment of well armed, friendly humans. They may stay the night here and avoid a random encounter for the night."
    },
    {
      "title": "Falling Dwarf",
      "description": "A dwarf falls out of the sky and splatters in front of the party. No logical source of the dwarf can be seen."
    },
    {
      "title": "Player Trips",
      "description": "A player (whoever does the roll) trips over, takes 1D4 bludgeoning damage."
    },
    {
      "title": "Stranger Asking for Escort",
      "description": "A stranger asks to be escorted to a town, but gives the party nothing for doing it."
    },
    {
      "title": "Wolf Tracks",
      "description": "The party finds the tracks of wolves going across the path (DC10 Nature/Survival)."
    },
    {
      "title": "Ranger Gives Wrong Directions",
      "description": "A local ranger gives the party directions to their next destination, but he’s an ******* that sends them the wrong way. Increase the journey length."
    },
    {
      "title": "Mysterious Arrow and Note",
      "description": "An arrow strikes a nearby tree, with a note attached to it. The note reads “You are a fool for looking!” No source of the arrow can be found."
    },
    {
      "title": "Dung Beetle",
      "description": "A dung beetle pushes a ball across the road. If disturbed, it bursts into a smog, doing 1D4 poison damage and leaves the party member poisoned."
    },
    {
      "title": "Mystery Key",
      "description": "A mystery key is found laying in the road. If used on a locked door, roll a D20. A 20 will unlock the door, after which the key is lost."
    },
    {
      "title": "Thick Fog",
      "description": "A thick fog prevents travel for the rest of the day."
    },
    {
      "title": "Travelling in the Wrong Direction",
      "description": "You were travelling in the wrong direction. Add a day of travel to your journey."
    },
    {
      "title": "Bard: Song of Rest",
      "description": "Lose any debuffs."
    },
    {
      "title": "Bard: Song of Good Health",
      "description": "Gain 1D8 temporary hitpoints."
    },
    {
      "title": "Bard: Song of Heroics",
      "description": "1D6 party members gain inspiration."
    },
    {
      "title": "Bard: Song of Misery",
      "description": "All party members with inspiration lose it."
    },
    {
      "title": "Bard: Song of Battle",
      "description": "The next combat encounter grants double xp reward."
    },
    {
      "title": "Bard: Song of Healing",
      "description": "Regain up to half your max HP."
    },
    {
      "title": "Bard: Song of Pain",
      "description": "Lose 1D8 HP (after the bard has long since passed)."
    },
    {
      "title": "Bard: Song of Storms",
      "description": "A storm starts and forces the party to stop for the rest of the day."
    },
    {
      "title": "Bard: A Song",
      "description": "Nothing special happens."
    },
    {
      "title": "Merchant: Potion of Vitality",
      "description": "Only useful item for sale is a potion of vitality, 25gp."
    },
    {
      "title": "Merchant: Armour and Basic Weapons",
      "description": "Studded leather armour and basic weapons."
    },
    {
      "title": "Merchant: Five Healing Potions",
      "description": "Five healing potions, 30gp each."
    },
    {
      "title": "Merchant: Basic Adventuring Equipment",
      "description": "Basic adventuring equipment."
    },
    {
      "title": "Merchant: Wood",
      "description": "Wood."
    },
    {
      "title": "Merchant: Hunters Bounty",
      "description": "Fresh meat, some herbs."
    },
    {
      "title": "Merchant: Herbalist",
      "description": "Herbalist (can give directions)."
    },
    {
      "title": "Merchant: Fisherman",
      "description": "Fisherman."
    },
    {
      "title": "Merchant: Gem & Jewelery",
      "description": "Gem & Jewelery merchant (500gp worth of loot)."
    },
    {
      "title": "Merchant: Bug Catcher",
      "description": "Bug catcher. A DC15 Nature check reveals a cartomoth, that will show them a shortcut if released. 10gp."
    },
    {
      "title": "Bickering Farmers",
      "description": "The party catches up with and overtakes a slow travelling farmer, bickering with his wife. They know nothing useful."
    },
    {
      "title": "Unusually Vocal Birdsong",
      "description": "There is an unusually vocal chorus of birdsong. Druids, Hunters, Clerics gain inspiration."
    },
    {
      "title": "Stranger Asks for Directions",
      "description": "A stranger asks for directions from the party to the last town they left. If they help him, he gives them 1D6x10 gold when they next appear in town, if ever."
    },
    {
      "title": "Goblin Heads on Spikes",
      "description": "A line of Goblin heads on spikes line the road. A sign written in Goblin next to them says “Traitors of Yeemik”."
    },
    {
      "title": "Man Trapped Under a Log",
      "description": "A man is trapped under a log. If the party helps him, he disappears - it was an illusion."
    },
    {
      "title": "Sword in a Stone",
      "description": "The party finds a sword in a stone. A DC15 Strength check pulls it out. It is a +1 Longsword."
    },
    {
      "title": "Flower Girl",
      "description": "A flower girl skips down the path towards the party, but disappears before she reaches them."
    },
    {
      "title": "Religion: Old and Young Priest",
      "description": "The party meets an old priest and a young priest, who offer them a blessing. The party has advantage on attacks against undead till they next take a long rest."
    },
    {
      "title": "Religion: Temple is Found",
      "description": "A temple is found on a roll. Use a D6 to determine which God, of the six below, it is dedicated to."
    },
    {
      "title": "Religion: Shrine to Tymora",
      "description": "If the party makes an offering, they all gain inspiration."
    },
    {
      "title": "Religion: Shrine to Chauntea",
      "description": "If the party makes an offering, the rest of the day has no violent encounters."
    },
    {
      "title": "Religion: Shrine to Mask",
      "description": "If the party makes an offering, they get a surprise round in their next encounter."
    },
    {
      "title": "Religion: Shrine to Mystra",
      "description": "If the party makes an offering, all spellslots are recovered."
    },
    {
      "title": "Religion: Shrine to Oghma",
      "description": "If the party makes an offering, they find a shortcut that reduces their journey by 1D4 encounters."
    },
    {
      "title": "Religion: Shrine to Waukeen",
      "description": "If the party makes an offering, they later find the amount they offered in each of their pockets."
    },
    {
      "title": "Religion: Abandoned, Unidentifiable Shrine",
      "description": "If the party doesn’t make an offering, they trigger a combat encounter."
    },
    {
      "title": "Religion: Shrine to Nature Spirits",
      "description": "If the party doesn’t make an offering, a great storm prevents them from travelling any further that day."
    },
    {
      "title": "Religion: Demon Shrine",
      "description": "If the party makes an offering, they trigger a combat encounter."
    },
    {
      "title": "Religion: Shrine to Bhaal, Destroyed",
      "description": "Nothing happens."
    },
    {
      "title": "Trap: Pitfall (DC10 Dex)",
      "description": "DC10 Dexterity check or 1D6 bludgeoning damage, pit fall."
    },
    {
      "title": "Trap: Pitfall (DC15 Dex)",
      "description": "DC15 Dexterity check or 1D8 bludgeoning damage, pit fall."
    },
    {
      "title": "Trap: Pitfall (DC20 Dex)",
      "description": "DC20 Dexterity check or 1D12 bludgeoning damage, pit fall."
    },
    {
      "title": "Trap: Snare (DC10 Perception)",
      "description": "DC10 Perception check or snared, 1D6 bludgeoning damage if cut loose without factoring in landing."
    },
    {
      "title": "Trap: Snare (DC15 Perception)",
      "description": "DC15 Perception check or snared, 1D6 bludgeoning damage if cut loose without factoring in landing."
    },
    {
      "title": "Trap: Snare (DC20 Perception)",
      "description": "DC20 Perception check or snared, 1D6 bludgeoning damage if cut loose without factoring in landing."
    },
    {
      "title": "Trap: Net (DC15 Perception)",
      "description": "DC15 Perception check or whole party snared by net, roll combat encounter."
    },
    {
      "title": "Trap: Cupcake Pitfall",
      "description": "A cupcake lays in the middle of the road. If the party approaches, they trigger a pitfall into spikes. 3D6 piercing damage."
    },
    {
      "title": "Trap: Magic Rune",
      "description": "Magic rune (DC15 Perception to detect) triggers, paralyzing party. Roll for a combat encounter."
    },
    {
      "title": "Trap: Hobgoblin Door",
      "description": "Door in the middle of the path. If opened, a Hobgoblin is on the other side and gets a surprise attack. If walked around, the Hobgoblin flees."
    },
    {
      "title": "Riddle: Tail and Head",
      "description": "An old man asks: 'I have a tail, but no body. I have a head, but no brain. What am I?' (Answer: coins, 50gp reward)"
    },
    {
      "title": "Riddle: Running Around Waterdeep",
      "description": "An old man asks: 'What is running around Waterdeep, yet never truly moving?' (Answer: The wall, Healing potion reward per player)"
    },
    {
      "title": "Riddle: Dry Rivers",
      "description": "An old man asks: 'My rivers are dry, my forests have no trees, my towns are flat and empty, and my roads cannot be walked on. What am I?' (Answer: A map. The party's journey is shortened)"
    },
    {
      "title": "Riddle: Two Bodies",
      "description": "An old man asks: 'Two bodies have I, though both joined in one. The more still I stand, the quicker I run. What am I?' (Answer: An hourglass. Time slows down if they get it, and immediately skips to night if they don’t)"
    },
    {
      "title": "Riddle: Ear That Cannot Hear",
      "description": "An old man asks: 'What kind of ear cannot hear?' (Answer: An ear of corn. Potion of Cure Silence, everyone deafened if they don’t get it)"
    },
    {
      "title": "Riddle: Four Wheels and Flies",
      "description": "An old man asks: 'What has four wheels and flies?' (Answer: A garbage wagon. Potion of flight if correct, attacked by Stirges if they don’t get it)"
    },
    {
      "title": "Hidden Chest: Gold Ring",
      "description": "A DC10 Perception check spots a small chest hidden in a tree. It contains a gold ring worth 20gp."
    },
    {
      "title": "Hidden Chest: 44gp",
      "description": "A DC15 Perception check spots a small chest hidden in a tree. It contains 44gp."
    },
    {
      "title": "Hidden Chest: +1 Short Sword",
      "description": "A DC20 Perception check spots a chest hidden in a tree. It contains a +1 Short Sword."
    },
    {
      "title": "Hidden Chest: Dead Mouse",
      "description": "A DC10 Perception check spots a small chest hidden in a tree. It contains a dead mouse."
    },
    {
      "title": "Strong Storm",
      "description": "A strong storm picks up."
    },
    {
      "title": "Random Cow",
      "description": "The party finds a random cow. No amount of investigation reveals anything of significance about the cow or where it came from."
    },
    {
      "title": "Stranger Escort (Reward)",
      "description": "A stranger asks to be escorted to the nearest town. If the party agrees, the stranger gives them 100gp upon delivery."
    },
    {
      "title": "Excited Gnomes",
      "description": "A group of excited gnomes bounce past the party. If the party is polite to them, one gives them a useless gizmo that makes a chirping noise when wound up."
    },
    {
      "title": "Man Trapped Under Log (Check)",
      "description": "A man is trapped under a log. If the party helps him, do a DC15 check. A failure drops the log and crushes the man. He has nothing of value on him, but the saviour gets inspiration if they succeed."
    },
    {
      "title": "Man Buried to Neck",
      "description": "A man is buried in the road up to his neck, with the ground around him undisturbed. If the party helps him, the head pops out the ground and crawls off on spider legs, cackling. The party takes a DC14 Wisdom saving throw, taking 1D10 psychic damage on a failure."
    },
    {
      "title": "Dragon Overhead",
      "description": "An enormous dragon flies over head."
    },
    {
      "title": "Hidden Caltrops",
      "description": "A DC10 Perception check spots caltrops over the floor which do 1D4 piercing damage to the party if they don’t spot them."
    },
    {
      "title": "Drunken Dwarf Wrestling",
      "description": "A drunken dwarf challenges the strongest looking party member to a wrestling match. A DC15 Strength check beats her, and she gives the party member 5gp. The party member gains a level of exhaustion on a failure."
    },
    {
      "title": "Useless Road Sign",
      "description": "A road sign points back to wherever the party came from, but is otherwise useless."
    },
    {
      "title": "Vagrant Asks for Food",
      "description": "A vagrant asks for food. Nothing happens if they give him some."
    },
    {
      "title": "Vagrant Asks for Money (No Effect)",
      "description": "A vagrant asks for money. Nothing happens if they give him some."
    },
    {
      "title": "Vagrant Asks for Money (Triple Back)",
      "description": "A vagrant asks for money. They get triple what they give back if they give him some."
    },
    {
      "title": "Owlbear Tracks",
      "description": "The party finds the tracks of an Owlbear going across the road (DC10 Nature/Survival)."
    },
    {
      "title": "Ranger Gives Correct Directions",
      "description": "A local ranger gives the party directions to their next destination, shorting their journey."
    },
    {
      "title": "Mirror Image Party",
      "description": "A mirror image of the party walks towards them, but disappears before reaching them."
    },
    {
      "title": "Pursued by Bush",
      "description": "The party notices that they are being followed by a bush, which runs into the forest when they attempt to investigate. If they pursue, they find a goblin, that throws a gold coin at them to make them go away."
    },
    {
      "title": "Stranger Tells Sins",
      "description": "A stranger on the road tells each PC to repent of their sins. He knows details."
    },
    {
      "title": "Confetti Door",
      "description": "A door stands in the middle of the road. If opened, the frame bursts with confetti, then disappears."
    },
    {
      "title": "Chest with 100gp",
      "description": "The party finds 100gp in a chest in the middle of the road."
    },
     {
      "title": "The Whispering Willows",
      "description": "A small grove of willow trees seems to be softly whispering a language the party does not understand."
    },
    {
      "title": "A Mysterious Portal",
      "description": "A shimmering portal flickers into existence, smelling faintly of ozone and wild magic. Where does it lead?"
    },
    {
      "title": "An Old Hermit's Advice",
      "description": "A wise, old hermit appears and offers the party cryptic advice about their current quest."
    },
    {
      "title": "The Storm Elemental",
      "description": "The skies darken and a whirlwind of wind and lightning, taking the form of an elemental, appears."
    }
  ]
}
